The [Tap] must be attached to duct.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId FittingMustBeOnDuct { get; }
  Visual Basic
Public Shared ReadOnly Property FittingMustBeOnDuct As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ FittingMustBeOnDuct {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures ConnectorFailures Class
  Autodesk.Revit.DB Namespace